Revit 2027 API
IFCUserDefinedPropertySet.ExportToFile Method
 Export property sets to a text file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void ExportToFile(
	Document document,
	string fileName
)
Public Shared Sub ExportToFile (
	document As Document,
	fileName As String
)
public:
static void ExportToFile(
	Document^ document,
	String^ fileName
)
static member ExportToFile :
        document : Document *
        fileName : string -> unit
Parameters
document Document
 The Revit document.
fileName String
 The full text file name.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
FileAccessException |  Failed to access the text file.
See Also
Reference
IFCUserDefinedPropertySet Class
Autodesk.Revit.DB Namespace